JarbasHiveMind/hivemind-esp32-client/examples/voice_pe_satellite/sdkconfig.defaults
# ESP32-S3 target
CONFIG_IDF_TARGET="esp32s3"

# PSRAM (octal, 80 MHz — required for Voice PE)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# Flash (16 MB)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# MbedTLS hardware acceleration + HiveMind cipher support
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_MBEDTLS_PKCS5_C=y
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_POLY1305_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
CONFIG_MBEDTLS_GCM_C=y

# HiveMind WebSocket buffer (larger for TTS audio chunks)
CONFIG_HIVEMIND_WS_BUFFER_SIZE=16384

# ESP-SR model storage in flash
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Stack sizes (ESP-SR AFE needs larger stacks)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# WiFi
CONFIG_EXAMPLE_WIFI_SSID="mywifi"
CONFIG_EXAMPLE_WIFI_PASSWORD="mypassword"
